mingdedi/passport-demo/sdkconfig.defaults
# --- 目标芯片 ---
CONFIG_IDF_TARGET="esp32c3"
# ESP32-C3 无 PSRAM

# --- Flash: 8MB 片内 ---
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=y

# --- 分区表: 自定义(对齐出厂布局, factory 3MB 给 BLE+LVGL 留余量) ---
CONFIG_PARTITION_TABLE_CUSTOM=y

# --- 控制台: USB-Serial-JTAG(GPIO18/19, 与背光 GPIO21 无冲突) ---
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# --- LVGL ---
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_UNSCII_16=y
# UI 含折线图/多页面/动画, 池比官方基线(24KB)加大一档
CONFIG_LV_MEM_SIZE_KILOBYTES=48

# --- 系统 ---
CONFIG_FREERTOS_HZ=1000

# --- BLE (RADIO.BLE 演示页: NimBLE 可连接广播) ---
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_NVS_PERSIST=y

# --- WiFi 在线服务(周期扫描目标 AP + NTP 上海时间): 双 NTP 服务器冗余 ---
CONFIG_LWIP_SNTP_MAX_SERVERS=3
